README.md

# Table of Contents

1.  [Project](#org814b8b9)
    1.  [Root](#org8cb8bfc)
2.  [Game](#orgb7cf645)
    1.  [Overview](#org59a7faa)
    2.  [Team](#org3272f6c)
    3.  [Gameplay](#org93289c6)
    4.  [Story](#org3823c58)
    5.  [Art and Aesthetics](#org4e356ac)
    6.  [Sound and Music](#org35dac43)
    7.  [Marketing and Release](#org381ad43)
    8.  [Post-Launch](#orgdb58ca3)
    9.  [Miscellaneous](#org4049a5d)



<a id="org814b8b9"></a>

# TODO Project

just an overall view of directory structure


<a id="org8cb8bfc"></a>

## Root


### assets

-   images
-   sounds
-   etc


### data

-   game data
-   save states
-   settings
-   config


### planetclicker

main source code for game

1.  \`\_<sub>init</sub>\_<sub>.py</sub>\`

2.  \`\_<sub>main</sub>\_<sub>.py</sub>\`


<a id="orgb7cf645"></a>

# Game


<a id="org59a7faa"></a>

## Overview

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">title</td>
<td class="org-left">Planet Clicker</td>
</tr>

<tr>
<td class="org-left">genres</td>
<td class="org-left">clicker, idler, strategy</td>
</tr>

<tr>
<td class="org-left">platforms</td>
<td class="org-left">steam (win, mac, linux), android?</td>
</tr>

<tr>
<td class="org-left">audiences</td>
<td class="org-left">casual</td>
</tr>

<tr>
<td class="org-left">summary</td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>


<a id="org3272f6c"></a>

## Team

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">role</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">adam</td>
<td class="org-left">ice cream</td>
</tr>

<tr>
<td class="org-left">ben</td>
<td class="org-left">telekinesis</td>
</tr>
</tbody>
</table>


<a id="org93289c6"></a>

## Gameplay


### TODO Core Mechanics

*Describe the main mechanics that players will engage with.*
*Highlight what makes these mechanics unique.*

-   start by clicking to generate **mana**
    -   have a resource counter that tracks mana
-   purchase planets/etc
    -   **planets** can automatically generate mana
-   upgrade sun, planets, click, etc
    -   sun can be upgraded to reduce cycle time (how long takes each planet to generate mana)
    -   planets can be upgraded in various ways
    -   click can be upgraded to increase the amount of resources obtained per click or over time.
-   unlock new areas, abilities, etc?
-   occasionally waves of enemies may spawn
-   player can purchase items such as new suns, skins, etc


### Strategy

-   must decide how to best spend their resources; eg, balancing between upgrading click power versus automation
-   timing of purchasing upgrades


### TODO Game Loop

*Explain the cycle of actions players will take.*
*What do players do repeatedly?*


### TODO Progression

How do players progress? (levels, experience, items)
Mention any leveling systems, skill trees, etc.


### TODO Difficulty

-   Describe how difficulty scales throughout the game.
-   Include any dynamic difficulty adjustments if applicable.


<a id="org3823c58"></a>

## Story


### TODO Narrative Overview

-   Summary of the game&rsquo;s story and themes.


### TODO Setting

-   Describe the game world, time period, and notable locations.


### TODO Characters

-   List main characters and their roles in the story.
-   Include a brief description and motivations for each character.


<a id="org4e356ac"></a>

## Art and Aesthetics


### TODO Art Style

-   Describe the

visual style (2D, 3D, pixel art, etc.)


### TODO Mood and Tone

-   Discuss the mood of the game (light-hearted, dark, comedic, etc.)


### User Interface

-   display various metrics clearly, enabling players to track their progress, understand resource generation rates, and make informed decisions about upgrades.
-   bright, colorful graphics, animations, and sound effects to provide immediate feedback and satisfaction from clicking or earning resources.


<a id="org35dac43"></a>

## Sound and Music


### TODO Sound Design

-   Talk about sound effects, ambiance, and how they enhance gameplay.


### TODO Music

-   Discuss themes or styles of music used throughout the game.


<a id="org381ad43"></a>

## Marketing and Release


### TODO Marketing Strategy

-   Describe how you intend to promote the game (social media, trailers, etc.)


### TODO Release Plan

-   Discuss the timeline for development, beta testing, and launch.


<a id="orgdb58ca3"></a>

## Post-Launch


### TODO Updates and Patches

-   Discuss plans for post-launch support, updates, and user feedback integration.


### TODO Community Engagement

-   Describe how you will engage with players after release.


<a id="org4049a5d"></a>

## TODO Miscellaneous

-   Any additional notes, inspirations, or ideas that don&rsquo;t fit elsewhere.

